from invalid_menu import cleaning,invalid_menu_item

assert cleaning() == print('\n' * 100), 'Нет очистки'
# Почему-то в сравнительной половине, если сделать не большие изменения, то тест всё ровно проходит.
assert invalid_menu_item('Ошибочное предупреждение') == \
       print('|-||-||-||-||-||-||-||-||-||-||-||-||-|''\n'
             '|-|                                 |-|''\n'
             '|-|                1                |-|''\n'
             '|-|                                 |-|''\n'
             '|-||-||-||-||-||-||-||-||-||-||-||-||-|'),\
    'фраза не работает'
assert invalid_menu_item('Очень длинное предупреждение, что нет денег совсем') == \
       print('|-||-||-||-||-||-||-||-||-||-||-||-||-|''\n'
             '|-|                                 |-|''\n'
             '|-|                2                |-|''\n'
             '|-|                                 |-|''\n'
             '|-||-||-||-||-||-||-||-||-||-||-||-||-|')
assert invalid_menu_item('Сообщение') == \
       print('|-||-||-||-||-||-||-||-||-||-||-||-||-|''\n'
             '|-|                                 |-|''\n'
             '|-|                3                |-|''\n'
             '|-|                                 |-|''\n'
             '|-||-||-||-||-||-||-||-||-||-||-||-||-|')
assert invalid_menu_item('Фраза ещё днинее чем чень длинноеgпредупреждениеденег совсем') == \
       print('|-||-||-||-||-||-||-||-||-||-||-||-||-|''\n'
             '|-|                                 |-|''\n'
             '|-|         60 max символов         |-|''\n'
             '|-|                                 |-|''\n'
             '|-||-||-||-||-||-||-||-||-||-||-||-||-|')